Repository: bethatkinson/rpart
Catalog: po/*.po
Languages: pt_br

source: Invalid time point
pt_br: Ponto de tempo inválido

source: Invalid event count
pt_br: Contagem de eventos inválida

source: Invalid error rule
pt_br: Regra de erro inválida

source: Invalid value for 'method'
pt_br: Valor inválido para 'method'

source: unknown error
pt_br: erro desconhecido

source: 'yback' not found
pt_br: 'yback' não encontrado

source: 'wback' not found
pt_br: 'wback' não encontrado

source: 'xback' not found
pt_br: 'xback' não encontrado

source: 'nback' not found
pt_br: 'nback' não encontrado

source: return value not a vector
pt_br: valor de retorno não é um vetor

source: returned value is the wrong length
pt_br: o valor retornado tem um comprimento errado

source: the expression expr1 did not return a vector!
pt_br: a expressão expr1 não retornou um vetor!
