Repository: bethatkinson/rpart
Catalog: po/R-*.po
Languages: pt_br

source: 'x' must be a numeric vector
pt_br: 'x' deve ser um vetor numérico

source: Not a legitimate "rpart" object
pt_br: Não é um objeto "rpart" legítimo

source: Plot not useful for classification or poisson trees
pt_br: Gráfico não útil para classificação ou árvores de poisson

source: fit is not a tree, just a root
pt_br: fit não é uma árvore, apenas uma raiz

source: 'cptable' does not contain cross-validation results
pt_br: 'cptable' não contém resultados de validação cruzada

source: Tree has variables not found in new data
pt_br: A árvore possui variáveis não encontradas em novos dados

source: type 'class' is only appropriate for classification
pt_br: o tipo 'class' é apropriado apenas para classificação

source: Invalid prediction for "rpart" object
pt_br: Previsão inválida para o objeto "rpart"

source: 'x' must be an "rpart" object
pt_br: 'x' deve ser um objeto "rpart"

source: Invalid type of residual
pt_br: Tipo de resíduo inválido

source: Not legitimate "rpart" tree and endpoint not a 2 level-factor
pt_br: Árvore "rpart" não legítima e endpoint não é um fator de 2 níveis

source: a 'formula' argument is required
pt_br: um argumento de 'formula' é necessário

source: Trees cannot handle interaction terms
pt_br: As árvores não conseguem lidar com termos de interação

source: negative weights not allowed
pt_br: pesos negativos não permitidos

source: Invalid method
pt_br: Método inválido

source: Argument %s not matched
pt_br: Argumento %s não correspondido

source: Wrong length for 'xval'
pt_br: Comprimento errado para 'xval'

source: Cost vector is the wrong length
pt_br: O vetor de custo tem o comprimento errado

source: Cost vector must be positive
pt_br: O vetor de custo deve ser positivo

source: Initialization routine is missing the 'summary' function
pt_br: A rotina de inicialização não possui a função 'summary'

source: no information available on parameters from previous call to plot()
pt_br: nenhuma informação disponível sobre os parâmetros da chamada anterior para plot()

source: No offset allowed in classification models
pt_br: Nenhum deslocamento permitido em modelos de classificação

source: The parms list must have names
pt_br: A lista de parâmetros deve ter nomes

source: 'parms' component not matched: %s
pt_br: Componente 'parms' não correspondido: %s

source: Priors must sum to 1
pt_br: A soma dos 'prior' deve ser igual a 1

source: Priors must be >= 0
pt_br: Priors devem ser >= 0

source: Wrong length for priors
pt_br: Comprimento errado para priors

source: Wrong length for loss matrix
pt_br: Comprimento errado para matriz de perda

source: Loss matrix must have zero on diagonals
pt_br: A matriz de perdas deve ter zero nas diagonais

source: Loss matrix cannot have negative elements
pt_br: A matriz de perdas não pode ter elementos negativos

source: Loss matrix has a row of zeros
pt_br: Matriz de perda tem uma linha de zeros

source: Invalid splitting rule
pt_br: Regra de divisão inválida

source: Parameter argument must be a list
pt_br: O argumento do parâmetro deve ser uma lista

source: The value of 'maxcompete' supplied is < 0; the value 0 was used instead
pt_br: O valor de 'maxcompete' fornecido é <0; o valor 0 foi usado em vez disso

source: The value of 'xval' supplied is < 0; the value 0 was used instead
pt_br: O valor de 'xval' fornecido é <0; o valor 0 foi usado em vez disso

source: Maximum depth is 30
pt_br: A profundidade máxima é 30

source: Maximum depth must be at least 1
pt_br: A profundidade máxima deve ser de pelo menos 1

source: The value of 'usesurrogate' supplied was out of range, the default value of 2 is used instead.
pt_br: O valor de 'usesurrogate' fornecido estava fora do intervalo; em vez disso, o valor padrão de 2 é usado.

source: The value of 'surrogatestyle' supplied was out of range, the default value of 0 is used instead.
pt_br: O valor de 'surrogatestyle' fornecido estava fora do intervalo; em vez disso, o valor padrão de 0 é usado.

source: Response must be a 'survival' object - use the 'Surv()' function
pt_br: A resposta deve ser um objeto de 'survival' - use a função 'Surv()'

source: Observation time must be > 0
pt_br: O tempo de observação deve ser > 0

source: No deaths in data set
pt_br: Nenhuma morte no conjunto de dados

source: You must input a named list for parms
pt_br: Você deve inserir uma lista nomeada para parms

source: Invalid error method for Poisson
pt_br: Método de erro inválido para Poisson

source: Invalid shrinkage value
pt_br: Valor de redução inválido

source: response must be a 2 column matrix or a vector
pt_br: a resposta deve ser um vetor ou uma matriz de 2 colunas

source: Number of events must be >= 0
pt_br: O número de eventos deve ser >= 0

source: User written methods must have 3 functions
pt_br: Os métodos escritos pelo usuário devem ter 3 funções

source: User written method does not contain an 'init' function
pt_br: O método escrito pelo usuário não contém uma função 'init'

source: User written method does not contain a 'split' function
pt_br: O método escrito pelo usuário não contém uma função 'split'

source: User written method does not contain an 'eval' function
pt_br: O método escrito pelo usuário não contém uma função 'eval'

source: User 'eval' function returned invalid label
pt_br: A função 'eval' do usuário retornou um rótulo inválido

source: User 'eval' function returned invalid deviance
pt_br: A função 'eval' do usuário retornou um desvio inválido

source: Invalid return from categorical 'split' function
pt_br: Retorno inválido da função 'split' categórica

source: User 'split' function returned invalid goodness
pt_br: A função 'split' do usuário retornou 'goodness' inválido

source: User 'split' function returned invalid direction
pt_br: A função 'split' do usuário retornou direção inválida

source: may not be applicable for this method
pt_br: pode não ser aplicável para este método

source: Not an "rpart" object
pt_br: Não é um objeto "rpart"

source: Nodes %s are not in this tree
pt_br: Os nós %s não estão nesta árvore

source: argument 'label' is no longer used
pt_br: o argumento 'label' não é mais usado

source: Invalid fit object
pt_br: Objeto 'fit' inválido

source: supplied nodes %s are not in this tree
pt_br: os nós fornecidos %s não estão nesta árvore

source: supplied nodes %s are leaves
pt_br: os nós fornecidos %s são folhas
